START_TEMPLATE = """Что может этот бот?

Это Мэтч GPT от VK Знакомств. Совсем скоро 14 февраля, самое время серьёзно подойти к сердечным вопросам. Хотите найти свой идеальный мэтч, чтобы провести с ним самый романтичный день в году? Мы вам поможем и укажем правильный путь.

Пройдите опрос от VK Знакомств и с помощью искусственного интеллекта узнайте, как выглядит ваш идеальный мэтч! Да, результат может быть неожиданным, но сердцу ведь не прикажешь, верно?"""

SUBSCRIBE_TEMPLATE = """Начнём? Да, идеальные мэтчи у нас выдаются бесплатно, но за валентинку. Вашей нам валентинкой будем считать подписку на наш телеграм-канал @vk_dating."""

MATCH_PREFERENCES_TEMPLATE = """Отлично! Теперь закройте глаза и представьте своего идеального мэтча. Кто перед вами?"""

BODY_TYPE_TEMPLATE = """Вкусы у всех разные! Какое телосложение предпочитаете?"""

HAIR_TYPE_TEMPLATE = """Прическа играет важную роль в образе. Выбирайте на свой вкус:"""

HAIR_COLOR_TEMPLATE = """Теперь выберем цвет волос:"""

DATE_STYLE_TEMPLATE = """Вот и настало 14 февраля, вы отправляетесь на свидание. В каком образе пришёл ваш мэтч?"""

PERSONALITY_TEMPLATE = """Вы начали общаться. В ходе разговора вы понимаете, какой характер у вашего спутника:"""

SPECIAL_FEATURE_TEMPLATE = """Вас привлекает одна небольшая особенность собеседника"""

FINAL_TEMPLATE = """Теперь вы медленно открываете глаза. Готовы встретиться со своим идеальным мэтчем?"""

MATCH_GENERATED_TEMPLATE = """Вот и долгожданная встреча! Теперь вы знаете, как выглядит ваш идеальный мэтч. Не похож на настоящего? Конечно, ведь это всего лишь генерация.

А для знакомства с реальными людьми переходите по кнопке ниже в VK Знакомства. Ваш настоящий идеальный мэтч уже заждался, так что не тяните!

P.S. 15 февраля мы опубликуем здесь итоги розыгрыша, в котором вы уже участвуете. Рандомно разыграем 15 Premium-подписок среди тех, кто ищет свой идеальный мэтч. А если пригласите в бот друзей по своей персональной ссылке, ваши шансы на победу возрастут!"""

INVITE_TEMPLATE = """Узнай, как выглядит пара твоей мечты с помощью искусственного интеллекта от VK Знакомств в боте Мэтч GPT: ссылка."""

